content/blog/setting-up-emacs-with-mu4e-protonmail-and-gmail/index.org
---
title: "Setting up Emacs with Mu4e, Protonmail, and Gmail"
date: 2025-01-11T00:53:38-07:00
draft: false
---

* Overview

Here's how to configure MU4e to work with Protonmail and Gmail simultaneously

* App password/XOauth
I'm using app passwords while they still last. Eventually this section will
contain information on setting up XOAUTH 2.0 when app passwords are fully phased
out.

Create your app password for your gmail account by doing the following:
- Open your gmail account settings
- Enable two factor authentication
- Create your app password using https://myaccount.google.com/apppasswords

The app password will be used by offlineimap to sign into your Gmail account.

* Mu4e Installation/Configuration

** Dependencies
First install the mu4e dependencies. We're building the application from source

#+begin_src bash
sudo apt install -y git meson libgmime-3.0-dev libxapian-dev gnutls-bin texinfo libcld2-dev cmake guile-3.0
#+end_src

** Compiling Mu4e
Run the following commands to compile MU4E.

#+begin_src bash
mkdir -p ~/Sources
git clone https://github.com/emacsmirror/mu4e ~/Sources/mu4e
cd ~/Sources/mu4e
./autogen.sh
make
sudo make install
#+end_src

* GPG Keys (Encrypting Password)

Generate your own GPG pair. This will be used to decrypt your password by
offlineimap. Please use the full-key-gen flag instead of following the example
below. I'm creating a passwordless GPG pair. Its absolutely not secure. This
avoids having to type a passphrase to decrypt your password files

#+begin_src bash
gpg --batch --passphrase '' --quick-gen-key proton@proton.local default default
gpg --list-keys
pass init <GPGID>
#+end_src

* Offline Imap (Downloading Emails) 
OfflineImap will be used to download the emails. Emacs will be used to send the
emails using its SMTP functionality

