public/blog/setting-up-emacs-with-mu4e-protonmail-and-gmail/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Setting up Emacs with Mu4e, Protonmail, and Gmail</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  <link href="https://cdnjs.cloudflare.com/ajax/libs/prism/1.27.0/themes/prism-tomorrow.min.css" rel="stylesheet">
</head>
<body>
  
<main>
  <h1>Setting up Emacs with Mu4e, Protonmail, and Gmail</h1>

  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Overview</a>
</li>
<li><a href="#headline-2">App password/XOauth</a>
</li>
<li><a href="#headline-3">Mu4e Installation/Configuration</a>
<ul>
<li><a href="#headline-4">Dependencies</a>
</li>
<li><a href="#headline-5">Compiling Mu4e</a>
</li>
</ul>
</li>
<li><a href="#headline-6">GPG Keys (Encrypting Password)</a>
</li>
<li><a href="#headline-7">Offline Imap (Downloading Emails) </a>
<ul>
<li><a href="#headline-8">Setup</a>
</li>
</ul>
</li>
<li><a href="#headline-9">Configuring Emacs</a>
<ul>
<li><a href="#headline-10">Basic Config</a>
</li>
<li><a href="#headline-11">Creating .authinfo.gpg file</a>
</li>
<li><a href="#headline-12">Using Mu4e</a>
</li>
</ul>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Overview
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
Here&#39;s how to configure MU4e to work with Protonmail and Gmail simultaneously</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
App password/XOauth
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>I&#39;m using app passwords while they still last. Eventually this section will
contain information on setting up XOAUTH 2.0 when app passwords are fully phased
out.</p>
<p>
Create your app password for your gmail account by doing the following:</p>
<ul>
<li>Open your gmail account settings</li>
<li>Enable two factor authentication</li>
<li>Create your app password using <a href="https://myaccount.google.com/apppasswords">https://myaccount.google.com/apppasswords</a></li>
</ul>
<p>The app password will be used by offlineimap to sign into your Gmail account.</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Mu4e Installation/Configuration
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Dependencies
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>First install the mu4e dependencies. We&#39;re building the application from source</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>sudo apt install -y git meson libgmime-3.0-dev libxapian-dev gnutls-bin texinfo libcld2-dev cmake guile-3.0</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Compiling Mu4e
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>Run the following commands to compile MU4E.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>mkdir -p ~/Sources
</span></span><span style="display:flex;"><span>git clone https://github.com/emacsmirror/mu4e ~/Sources/mu4e
</span></span><span style="display:flex;"><span>cd ~/Sources/mu4e
</span></span><span style="display:flex;"><span>./autogen.sh
</span></span><span style="display:flex;"><span>make
</span></span><span style="display:flex;"><span>sudo make install</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
GPG Keys (Encrypting Password)
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>
Generate your own GPG pair. This will be used to decrypt your password by
offlineimap. Please use the full-key-gen flag instead of following the example
below. I&#39;m creating a passwordless GPG pair. Its absolutely not secure. This
avoids having to type a passphrase to decrypt your password files</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>gpg --batch --passphrase <span style="color:#e6db74">&#39;&#39;</span> --quick-gen-key proton@proton.local default default
</span></span><span style="display:flex;"><span>gpg --list-keys
</span></span><span style="display:flex;"><span>pass init &lt;GPGID&gt;</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
Offline Imap (Downloading Emails) 
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>OfflineImap will be used to download the emails. Emacs will be used to send the
emails using its SMTP functionality</p>
