content/blog/setting-up-emacs-with-mu4e-protonmail-and-gmail/index.org
** Setup

Create a folder to store your emails

#+begin_src bash
mkdir -p ~/Mail/email@gmail.com
#+end_src

Create the following .offlineimap.py script. This will be used in the
.offlineimaprc to decrypt our password file

#+begin_src bash
cat <<OEM > ~/.offlineimap.py
#! /usr/bin/env python
from subprocess import check_output

def get_pass(account):
    return check_output("pass email/" + account, bash=True).splitlines()[0]
OEM
#+end_src

Now create the main configuration used to download the emails. The only thing
you need to replace is any reference to email@gmail.com

#+begin_src bash
cat <<OEM > ~/.offlineimaprc
[general]
accounts = main
maxsyncaccounts = 3
socktimeout = 60
pythonfile = ~/.offlineimap.py

ui = TTY.TTYUI

[Account main]
# identifier for local repository i.e. /user/dericbytes/mail
localrepository = main-local
# identifier for remote repository i.e. imap.google.com
remoterepository = gmail-remote

[Repository main-local]
# Sync with a mail directory (Maildir) or another IMAP mail server (IMAP)
type = Maildir
# Where to store synced mail
localfolders = /home/peter/Mail/email@gmail.com
nametrans = lambda folder: re.sub ('important', '^\[Gmail\].Important',
                           re.sub('all', '[Gmail].All Mail'       ,
                           re.sub('sent'    , '[Gmail].Sent Mail' ,
                           re.sub('drafts'  , '[Gmail].Drafts'    ,
                           folder))))
folderfilter = lambda folder: folder not in ['important']



[Repository gmail-remote]
type = Gmail
remoteuser = email@gmail.com
remotepasseval = get_pass("email@gmail.com")

nametrans = lambda folder: re.sub ('^\[Gmail\].Important', 'important',
                           re.sub('.*All Mail$'  , 'all',
                           re.sub('.*Sent Mail$' , 'sent',
                           re.sub('.*Drafts$'    , 'drafts',
                           folder))))
folderfilter = lambda folder: folder not in ['[Gmail]/All Mail',
                                             '[Gmail]/Important',
                                             '[Gmail]/Starred',
                                             ]

# Necessary as of OfflineIMAP 6.5.4
sslcacertfile = /etc/ssl/certs/ca-certificates.crt
# Necessary to work around https://github.com/OfflineIMAP/offlineimap/issues/573 (versions 7.0.12, 7.2.1)
ssl_version = tls1_2
OEM
#+end_src

Run the following to commands. ~offlineimap~ is used to start the email
download. Mu will index the downloaded emails.


#+begin_src bash
offlineimap

mu init --maildir=~/Mail \
    --my-address=email@gmail.com \
#+end_src

* Configuring Emacs
At this point you would have installed the emacs mu4e package from source,
downloaded your emails to a folder, and lastly indexed it with Mu4e.

Now its time to configure Emacs to show you emails in that folder. I won't
explain this configuration file. I'll leave this up to your responsibility.

This configuration file will work with your email. I stripped out the
mu4e-folding and mu4e-thread packages from the config. They provide UI
improvements to Mu4e and the installation of these plugins are out of the scope
of this guide.


