public/blog/setting-up-emacs-with-mu4e-protonmail-and-gmail/index.html
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Setup
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>
Create a folder to store your emails</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>mkdir -p ~/Mail/email@gmail.com</span></span></code></pre></div>
</div>
<p>
Create the following .offlineimap.py script. This will be used in the
.offlineimaprc to decrypt our password file</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>cat <span style="color:#e6db74">&lt;&lt;OEM &gt; ~/.offlineimap.py
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">#! /usr/bin/env python
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">from subprocess import check_output
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">def get_pass(account):
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">    return check_output(&#34;pass email/&#34; + account, bash=True).splitlines()[0]
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">OEM</span></span></span></code></pre></div>
</div>
<p>
Now create the main configuration used to download the emails. The only thing
you need to replace is any reference to email@gmail.com</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>cat <span style="color:#e6db74">&lt;&lt;OEM &gt; ~/.offlineimaprc
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">[general]
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">accounts = main
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">maxsyncaccounts = 3
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">socktimeout = 60
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">pythonfile = ~/.offlineimap.py
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">ui = TTY.TTYUI
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">[Account main]
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74"># identifier for local repository i.e. /user/dericbytes/mail
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">localrepository = main-local
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74"># identifier for remote repository i.e. imap.google.com
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">remoterepository = gmail-remote
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">[Repository main-local]
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74"># Sync with a mail directory (Maildir) or another IMAP mail server (IMAP)
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">type = Maildir
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74"># Where to store synced mail
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">localfolders = /home/user/Mail/email@gmail.com
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">nametrans = lambda folder: re.sub (&#39;important&#39;, &#39;^\[Gmail\].Important&#39;,
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">                           re.sub(&#39;all&#39;, &#39;[Gmail].All Mail&#39;       ,
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">                           re.sub(&#39;sent&#39;    , &#39;[Gmail].Sent Mail&#39; ,
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">                           re.sub(&#39;drafts&#39;  , &#39;[Gmail].Drafts&#39;    ,
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">                           folder))))
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">folderfilter = lambda folder: folder not in [&#39;important&#39;]
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">[Repository gmail-remote]
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">type = Gmail
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">remoteuser = email@gmail.com
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">remotepasseval = get_pass(&#34;email@gmail.com&#34;)
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">nametrans = lambda folder: re.sub (&#39;^\[Gmail\].Important&#39;, &#39;important&#39;,
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">                           re.sub(&#39;.*All Mail$&#39;  , &#39;all&#39;,
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">                           re.sub(&#39;.*Sent Mail$&#39; , &#39;sent&#39;,
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">                           re.sub(&#39;.*Drafts$&#39;    , &#39;drafts&#39;,
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">                           folder))))
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">folderfilter = lambda folder: folder not in [&#39;[Gmail]/All Mail&#39;,
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">                                             &#39;[Gmail]/Important&#39;,
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">                                             &#39;[Gmail]/Starred&#39;,
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">                                             ]
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74"># Necessary as of OfflineIMAP 6.5.4
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">sslcacertfile = /etc/ssl/certs/ca-certificates.crt
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74"># Necessary to work around https://github.com/OfflineIMAP/offlineimap/issues/573 (versions 7.0.12, 7.2.1)
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">ssl_version = tls1_2
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">OEM</span></span></span></code></pre></div>
</div>
<p>
Run the following to commands. <code>offlineimap</code> is used to start the email
download. Mu will index the downloaded emails.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>offlineimap
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>mu init --maildir<span style="color:#f92672">=</span>~/Mail <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>    --my-address<span style="color:#f92672">=</span>email@gmail.com <span style="color:#960050;background-color:#1e0010">\</span></span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
Configuring Emacs
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>At this point you would have installed the emacs mu4e package from source,
downloaded your emails to a folder, and lastly indexed it with Mu4e.</p>
<p>
Now its time to configure Emacs to show you emails in that folder. I won&#39;t
explain this configuration file. I&#39;ll leave this up to your responsibility.</p>
<p>
This configuration file will work with your email. I stripped out the
mu4e-folding and mu4e-thread packages from the config. They provide UI
improvements to Mu4e and the installation of these plugins are out of the scope
of this guide.</p>
