public/blog/setting-up-emacs-with-mu4e-protonmail-and-gmail/index.html
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
Basic Config
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<div class="src src-emacs-lisp">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-emacs-lisp" data-lang="emacs-lisp"><span style="display:flex;"><span>(require <span style="color:#e6db74">&#39;auth-source</span>)
</span></span><span style="display:flex;"><span>(setq auth-sources <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;~/.authinfo.gpg&#34;</span>))
</span></span><span style="display:flex;"><span>(setf epg-pinentry-mode <span style="color:#e6db74">&#39;loopback</span>)
</span></span><span style="display:flex;"><span>(setq auth-source-debug <span style="color:#66d9ef">nil</span>)
</span></span><span style="display:flex;"><span>(defun pinentry-emacs (desc prompt ok <span style="color:#a6e22e">error</span>)
</span></span><span style="display:flex;"><span>  (let ((str (read-passwd
</span></span><span style="display:flex;"><span>              (<span style="color:#a6e22e">concat</span> (replace-regexp-in-string <span style="color:#e6db74">&#34;%22&#34;</span> <span style="color:#e6db74">&#34;\&#34;&#34;</span>
</span></span><span style="display:flex;"><span>                                                (replace-regexp-in-string <span style="color:#e6db74">&#34;%0A&#34;</span> <span style="color:#e6db74">&#34;\n&#34;</span> desc)) prompt <span style="color:#e6db74">&#34;: &#34;</span>))))
</span></span><span style="display:flex;"><span>    str))
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>(when (<span style="color:#a6e22e">file-directory-p</span> <span style="color:#e6db74">&#34;/usr/local/share/emacs/site-lisp/mu4e&#34;</span>)
</span></span><span style="display:flex;"><span>  (require <span style="color:#e6db74">&#39;mu4e</span>)
</span></span><span style="display:flex;"><span>  (require <span style="color:#e6db74">&#39;mu4e-contrib</span>)
</span></span><span style="display:flex;"><span>  (setq mu4e-maildir <span style="color:#e6db74">&#34;~/Mail&#34;</span>) <span style="color:#75715e">; Default folder containing email</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-attachment-dir <span style="color:#e6db74">&#34;~/Downloads&#34;</span>) <span style="color:#75715e">; Default folder for downloaded items</span>
</span></span><span style="display:flex;"><span>  (setq message-kill-buffer-on-exit <span style="color:#66d9ef">t</span>) <span style="color:#75715e">; Don&#39;t keep message buffers around</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-compose-keep-self-cc <span style="color:#66d9ef">nil</span>) <span style="color:#75715e">; Avoid keeping self in CC</span>
</span></span><span style="display:flex;"><span>  (setq send-mail-function <span style="color:#e6db74">&#39;smtpmail-send-it</span>) <span style="color:#75715e">; Function to send mail (via SMTP)</span>
</span></span><span style="display:flex;"><span>  (setq smtpmail-stream-type <span style="color:#e6db74">&#39;starttls</span>) <span style="color:#75715e">; Specify the type of SMTP connections to use</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-html2text-command <span style="color:#e6db74">&#34;w3m -T text/html&#34;</span>) <span style="color:#75715e">; Command to convert HTML emails to plain text</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-headers-auto-update  <span style="color:#66d9ef">t</span>) <span style="color:#75715e">; Automatically update headers</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-view-show-images  <span style="color:#66d9ef">t</span>) <span style="color:#75715e">; Enable inline images in emails</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-compose-signature-auto-include  <span style="color:#66d9ef">nil</span>)<span style="color:#75715e">; Disables automatic inclusion of signatures in new emails</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-search-full <span style="color:#66d9ef">t</span>) <span style="color:#75715e">; Search for all results rather than up to &#39;mu4e-search-results-limit&#39;</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-use-fancy-chars  <span style="color:#66d9ef">t</span>) <span style="color:#75715e">; Use fancy characters in the interface</span>
</span></span><span style="display:flex;"><span>  (setq mail-user-agent <span style="color:#e6db74">&#39;mu4e-user-agent</span>) <span style="color:#75715e">; Set mu4e as the default email agent</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-completing-read-function <span style="color:#e6db74">&#39;ivy-completing-read</span>) <span style="color:#75715e">; Use Ivy for completing read prompts</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-confirm-quit <span style="color:#66d9ef">nil</span>)
</span></span><span style="display:flex;"><span>  (setq mu4e-headers-show-threads <span style="color:#66d9ef">t</span>) <span style="color:#75715e">; Show threads</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-compose-in-new-frame <span style="color:#66d9ef">t</span>) <span style="color:#75715e">; Allows reading other emails while composing</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-compose-dont-reply-to-self <span style="color:#66d9ef">t</span>) <span style="color:#75715e">; Dont include self when replying</span>
</span></span><span style="display:flex;"><span>  (setq message-citation-line-function <span style="color:#e6db74">&#39;message-insert-formatted-citation-line</span>) <span style="color:#75715e">;; Citation</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-sent-messages-behavior <span style="color:#e6db74">&#39;delete</span>) <span style="color:#75715e">; Don&#39;t save message to Sent Messages, IMAP takes care of this</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-get-mail-command <span style="color:#e6db74">&#34;offlineimap&#34;</span>)
</span></span><span style="display:flex;"><span>  (setq mu4e-change-filenames-when-moving <span style="color:#66d9ef">t</span>) <span style="color:#75715e">; needed for mbsync</span>
</span></span><span style="display:flex;"><span>  (setq mu4e-update-interval <span style="color:#ae81ff">60</span>) <span style="color:#75715e">; Update 30 seconds</span>
</span></span><span style="display:flex;"><span>  (add-hook <span style="color:#e6db74">&#39;mu4e-view-mode-hook</span> <span style="color:#a6e22e">#&#39;</span>visual-line-mode) <span style="color:#75715e">; Enable visual-line-mode in the email view mode</span>
</span></span><span style="display:flex;"><span>  (add-hook <span style="color:#e6db74">&#39;mu4e-compose-mode-hook</span> <span style="color:#a6e22e">#&#39;</span>(lambda () (auto-save-mode <span style="color:#ae81ff">1</span>)))
</span></span><span style="display:flex;"><span>  (add-hook <span style="color:#e6db74">&#39;message-send-hook</span> <span style="color:#75715e">; Confirmation before sending</span>
</span></span><span style="display:flex;"><span>	    (lambda ()
</span></span><span style="display:flex;"><span>	      (unless (<span style="color:#a6e22e">yes-or-no-p</span> <span style="color:#e6db74">&#34;Sure you want to send this?&#34;</span>)
</span></span><span style="display:flex;"><span>		(<span style="color:#a6e22e">signal</span> <span style="color:#e6db74">&#39;quit</span> <span style="color:#66d9ef">nil</span>))))
</span></span><span style="display:flex;"><span>  (add-hook <span style="color:#e6db74">&#39;mu4e-compose-mode-hook</span> <span style="color:#75715e">; Spell Check</span>
</span></span><span style="display:flex;"><span>	    (defun my-do-compose-stuff ()
</span></span><span style="display:flex;"><span>	      <span style="color:#e6db74">&#34;My settings for message composition.&#34;</span>
</span></span><span style="display:flex;"><span>	      (set-fill-column <span style="color:#ae81ff">80</span>)
</span></span><span style="display:flex;"><span>	      (jinx-mode <span style="color:#ae81ff">1</span>)))
</span></span><span style="display:flex;"><span>  (add-hook <span style="color:#e6db74">&#39;minibuffer-setup-hook</span> (lambda () (setq mu4e-hide-index-messages <span style="color:#66d9ef">t</span>))) <span style="color:#75715e">; Hide Mu4E update log from minibuffer</span>
</span></span><span style="display:flex;"><span>  (add-hook <span style="color:#e6db74">&#39;minibuffer-exit-hook</span> (lambda () (setq mu4e-hide-index-messages <span style="color:#66d9ef">nil</span>)))
</span></span><span style="display:flex;"><span>  (setq <span style="color:#75715e">; Custom header glyphs</span>
</span></span><span style="display:flex;"><span>   mu4e-headers-draft-mark     <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;D&#34;</span>  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;✎&#34;</span>)
</span></span><span style="display:flex;"><span>   mu4e-headers-flagged-mark   <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;F&#34;</span>  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;⚑&#34;</span>)
</span></span><span style="display:flex;"><span>   mu4e-headers-new-mark       <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;N&#34;</span>  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;🔥&#34;</span>)
</span></span><span style="display:flex;"><span>   mu4e-headers-passed-mark    <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;&gt;&#34;</span>  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;➜&#34;</span>)
</span></span><span style="display:flex;"><span>   mu4e-headers-replied-mark   <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;&lt;&#34;</span>  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;↶&#34;</span>)
</span></span><span style="display:flex;"><span>   mu4e-headers-seen-mark      <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;✓&#34;</span>  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;✔&#34;</span>)
</span></span><span style="display:flex;"><span>   mu4e-headers-trashed-mark   <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;X&#34;</span>  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;☠&#34;</span>)
</span></span><span style="display:flex;"><span>   mu4e-headers-attach-mark    <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;A&#34;</span>  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;⎘&#34;</span>)
</span></span><span style="display:flex;"><span>   mu4e-headers-encrypted-mark <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;E&#34;</span>  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;🔒&#34;</span>)
</span></span><span style="display:flex;"><span>   mu4e-headers-signed-mark    <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;S&#34;</span>  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;✍&#34;</span>)
</span></span><span style="display:flex;"><span>   mu4e-headers-unread-mark    <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;U&#34;</span>  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;⬢&#34;</span>)
</span></span><span style="display:flex;"><span>   mu4e-headers-calendar-mark  <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;C&#34;</span>  <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34;⏳&#34;</span>))
</span></span><span style="display:flex;"><span>  )
</span></span><span style="display:flex;"><span>(setq mu4e-headers-thread-child-prefix <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34; L  &#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34; │  &#34;</span>) <span style="color:#75715e">; Custom thread icons</span>
</span></span><span style="display:flex;"><span>      mu4e-headers-thread-connection-prefix <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34; |  &#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34; │  &#34;</span>)
</span></span><span style="display:flex;"><span>      mu4e-headers-thread-duplicate-prefix <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34; =  &#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34; ≡  &#34;</span>)
</span></span><span style="display:flex;"><span>      mu4e-headers-thread-first-child-prefix <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34; L  &#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34; ⚬  &#34;</span>)
</span></span><span style="display:flex;"><span>      mu4e-headers-thread-last-child-prefix <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34; └─ &#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">&#34; └─ &#34;</span>))
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>(defun compose-reply-wide-or-not-please-ask ()
</span></span><span style="display:flex;"><span>  <span style="color:#e6db74">&#34;Ask whether to reply-to-all or not.&#34;</span>
</span></span><span style="display:flex;"><span>  (interactive)
</span></span><span style="display:flex;"><span>  (mu4e-compose-reply (<span style="color:#a6e22e">yes-or-no-p</span> <span style="color:#e6db74">&#34;Reply to all?&#34;</span>)))
</span></span><span style="display:flex;"><span>(<span style="color:#a6e22e">define-key</span> mu4e-compose-minor-mode-map (kbd <span style="color:#e6db74">&#34;R&#34;</span>) <span style="color:#a6e22e">#&#39;</span>compose-reply-wide-or-not-please-ask)
</span></span><span style="display:flex;"><span>(<span style="color:#a6e22e">define-key</span> mu4e-headers-mode-map (kbd <span style="color:#e6db74">&#34;R&#34;</span>) <span style="color:#e6db74">&#39;compose-reply-wide-or-not-please-ask</span>)
</span></span><span style="display:flex;"><span>(<span style="color:#a6e22e">define-key</span> mu4e-view-mode-map (kbd <span style="color:#e6db74">&#34;R&#34;</span>) <span style="color:#e6db74">&#39;compose-reply-wide-or-not-please-ask</span>)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>(defun my-add-header ()
</span></span><span style="display:flex;"><span>  <span style="color:#e6db74">&#34;Add CC and BCC headers automatically&#34;</span>
</span></span><span style="display:flex;"><span>  (save-excursion (message-add-header
</span></span><span style="display:flex;"><span>                   (<span style="color:#a6e22e">concat</span> <span style="color:#e6db74">&#34;CC: &#34;</span> <span style="color:#e6db74">&#34;\n&#34;</span>)
</span></span><span style="display:flex;"><span>                   <span style="color:#75715e">;; pre hook above changes user-mail-address.</span>
</span></span><span style="display:flex;"><span>                   (<span style="color:#a6e22e">concat</span> <span style="color:#e6db74">&#34;Bcc: &#34;</span> <span style="color:#e6db74">&#34;\n&#34;</span>))))
</span></span><span style="display:flex;"><span>(add-hook <span style="color:#e6db74">&#39;mu4e-compose-mode-hook</span> <span style="color:#e6db74">&#39;my-add-header</span>)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>(setq mu4e-view-fields <span style="color:#f92672">&#39;</span>(:from :to :subject :date :maildir :tags))
</span></span><span style="display:flex;"><span>(setq mu4e-view-hide-cited <span style="color:#66d9ef">t</span>)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>(defun mu4e-set-all-as-read ()
</span></span><span style="display:flex;"><span>  <span style="color:#e6db74">&#34;Make all emails read.&#34;</span>
</span></span><span style="display:flex;"><span>  (interactive)
</span></span><span style="display:flex;"><span>  (require <span style="color:#e6db74">&#39;mu4e-contrib</span>)
</span></span><span style="display:flex;"><span>  (with-temp-buffer
</span></span><span style="display:flex;"><span>    (mu4e-headers-search-bookmark <span style="color:#e6db74">&#34;flag:unread AND NOT flag:trashed&#34;</span>)
</span></span><span style="display:flex;"><span>    (<span style="color:#a6e22e">sleep-for</span> <span style="color:#ae81ff">0.15</span>)
</span></span><span style="display:flex;"><span>    (mu4e-headers-mark-all-unread-read)
</span></span><span style="display:flex;"><span>    (mu4e-mark-execute-all <span style="color:#e6db74">&#39;no-confirmation</span>)))
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>(setq user-mail-address <span style="color:#e6db74">&#34;email@gmail.com&#34;</span>
</span></span><span style="display:flex;"><span>      <span style="color:#a6e22e">user-full-name</span> <span style="color:#e6db74">&#34;First Last&#34;</span>
</span></span><span style="display:flex;"><span>      mu4e-drafts-folder <span style="color:#e6db74">&#34;/email@gmail.com/[Gmail]/Drafts&#34;</span>
</span></span><span style="display:flex;"><span>      mu4e-sent-folder <span style="color:#e6db74">&#34;/email@gmail.com/[Gmail]/Sent Mail&#34;</span>
</span></span><span style="display:flex;"><span>      mu4e-refile-folder <span style="color:#e6db74">&#34;/email@gmail.com/[Gmail]/All Mail&#34;</span>
</span></span><span style="display:flex;"><span>      mu4e-trash-folder <span style="color:#e6db74">&#34;/email@gmail.com/[Gmail]/Trash&#34;</span>
</span></span><span style="display:flex;"><span>      smtpmail-smtp-server <span style="color:#e6db74">&#34;smtp.gmail.com&#34;</span>
</span></span><span style="display:flex;"><span>      smtpmail-smtp-service <span style="color:#ae81ff">587</span>
</span></span><span style="display:flex;"><span>      mu4e-compose-reply-ignore-address <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;no-?reply&#34;</span> <span style="color:#e6db74">&#34;email@gmail.com&#34;</span>)
</span></span><span style="display:flex;"><span>      mu4e-maildir-shortcuts <span style="color:#f92672">&#39;</span>((<span style="color:#e6db74">&#34;/email@gmail.com/INBOX&#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">?i</span>)
</span></span><span style="display:flex;"><span>                               (<span style="color:#e6db74">&#34;/email@gmail.com/sent&#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">?s</span>)
</span></span><span style="display:flex;"><span>                               (<span style="color:#e6db74">&#34;/email@gmail.com/[Gmail].Trash&#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">?t</span>)
</span></span><span style="display:flex;"><span>                               (<span style="color:#e6db74">&#34;/email@gmail.com/[Gmail].Spam&#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">?j</span>)
</span></span><span style="display:flex;"><span>                               (<span style="color:#e6db74">&#34;/email@gmail.com[Gmail]/Drafts&#34;</span> <span style="color:#f92672">.</span> <span style="color:#e6db74">?d</span>)))
</span></span><span style="display:flex;"><span>(setq mu4e-bookmarks <span style="color:#75715e">; Bookmarks for quick email search</span>
</span></span><span style="display:flex;"><span>      <span style="color:#f92672">&#39;</span>((:name  <span style="color:#e6db74">&#34;Unread messages&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;flag:unread and maildir:/email@gmail.com/INBOX&#34;</span>
</span></span><span style="display:flex;"><span>                :key   <span style="color:#e6db74">?u</span>)
</span></span><span style="display:flex;"><span>        (:name  <span style="color:#e6db74">&#34;Today&#39;s messages&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;date:today..now&#34;</span>
</span></span><span style="display:flex;"><span>                :key <span style="color:#e6db74">?t</span>)
</span></span><span style="display:flex;"><span>        (:name  <span style="color:#e6db74">&#34;Last 7 days&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;date:7d..now&#34;</span>
</span></span><span style="display:flex;"><span>                :key <span style="color:#e6db74">?7</span>)
</span></span><span style="display:flex;"><span>        (:name  <span style="color:#e6db74">&#34;Messages with PDF&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;mime:application/pdf&#34;</span>
</span></span><span style="display:flex;"><span>                :key <span style="color:#e6db74">?p</span>)
</span></span><span style="display:flex;"><span>        (:name  <span style="color:#e6db74">&#34;Messages with images&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;mime:image/*&#34;</span>
</span></span><span style="display:flex;"><span>                :key <span style="color:#e6db74">?I</span>)
</span></span><span style="display:flex;"><span>        (:name  <span style="color:#e6db74">&#34;Messages with calendar event&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;mime:text/calendar&#34;</span>
</span></span><span style="display:flex;"><span>                :key <span style="color:#e6db74">?e</span>)
</span></span><span style="display:flex;"><span>        (:name  <span style="color:#e6db74">&#34;Messages with Word docs&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;mime:application/msword OR mime:application/vnd.openxmlformats-officedocument.wordprocessingml.document&#34;</span>
</span></span><span style="display:flex;"><span>                :key <span style="color:#e6db74">?w</span>)
</span></span><span style="display:flex;"><span>	(:name  <span style="color:#e6db74">&#34;Inbox&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;maildir:/email@gmail.com/INBOX&#34;</span>
</span></span><span style="display:flex;"><span>                :key   <span style="color:#e6db74">?i</span>)
</span></span><span style="display:flex;"><span>        (:name  <span style="color:#e6db74">&#34;Sent&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;maildir:/email@gmail.com/sent&#34;</span>
</span></span><span style="display:flex;"><span>                :key   <span style="color:#e6db74">?s</span>)
</span></span><span style="display:flex;"><span>        (:name  <span style="color:#e6db74">&#34;Trash&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;maildir:/email@gmail.com/[Gmail].Trash&#34;</span>
</span></span><span style="display:flex;"><span>                :key   <span style="color:#e6db74">?T</span>)
</span></span><span style="display:flex;"><span>        (:name  <span style="color:#e6db74">&#34;Spam&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;maildir:/email@gmail.com/[Gmail].Spam&#34;</span>
</span></span><span style="display:flex;"><span>                :key   <span style="color:#e6db74">?J</span>)
</span></span><span style="display:flex;"><span>	(:name  <span style="color:#e6db74">&#34;Year 2025&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;date:20250101..20251231&#34;</span>
</span></span><span style="display:flex;"><span>                :key <span style="color:#e6db74">?5</span>)
</span></span><span style="display:flex;"><span>        (:name  <span style="color:#e6db74">&#34;Year 2024&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;date:20240101..20241231&#34;</span>
</span></span><span style="display:flex;"><span>                :key <span style="color:#e6db74">?4</span>)
</span></span><span style="display:flex;"><span>        (:name  <span style="color:#e6db74">&#34;Year 2023&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;date:20230101..20231231&#34;</span>
</span></span><span style="display:flex;"><span>                :key <span style="color:#e6db74">?3</span>)
</span></span><span style="display:flex;"><span>        (:name  <span style="color:#e6db74">&#34;Year 2022&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;date:20220101..20221231&#34;</span>
</span></span><span style="display:flex;"><span>                :key <span style="color:#e6db74">?2</span>)
</span></span><span style="display:flex;"><span>        (:name  <span style="color:#e6db74">&#34;Year 2021&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;date:20210101..20211231&#34;</span>
</span></span><span style="display:flex;"><span>                :key <span style="color:#e6db74">?1</span>)
</span></span><span style="display:flex;"><span>        (:name  <span style="color:#e6db74">&#34;Year 2020&#34;</span>
</span></span><span style="display:flex;"><span>                :query <span style="color:#e6db74">&#34;date:20200101..20201231&#34;</span>
</span></span><span style="display:flex;"><span>                :key <span style="color:#e6db74">?0</span>)
</span></span><span style="display:flex;"><span>	))
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>(defun message-attachment-present-p () <span style="color:#75715e">; Warn if no attachments are present, but if the text talks about attachments:</span>
</span></span><span style="display:flex;"><span>  <span style="color:#e6db74">&#34;Return t if an attachment is found in the current message.&#34;</span>
</span></span><span style="display:flex;"><span>  (save-excursion
</span></span><span style="display:flex;"><span>    (save-restriction
</span></span><span style="display:flex;"><span>      (<span style="color:#a6e22e">widen</span>)
</span></span><span style="display:flex;"><span>      (<span style="color:#a6e22e">goto-char</span> (<span style="color:#a6e22e">point-min</span>))
</span></span><span style="display:flex;"><span>      (when (<span style="color:#a6e22e">search-forward</span> <span style="color:#e6db74">&#34;&lt;#part&#34;</span> <span style="color:#66d9ef">nil</span> <span style="color:#66d9ef">t</span>) <span style="color:#66d9ef">t</span>))))
</span></span><span style="display:flex;"><span>(defcustom message-attachment-intent-re
</span></span><span style="display:flex;"><span>  (regexp-opt <span style="color:#f92672">&#39;</span>(<span style="color:#e6db74">&#34;attach&#34;</span>
</span></span><span style="display:flex;"><span>                <span style="color:#e6db74">&#34;attached&#34;</span>
</span></span><span style="display:flex;"><span>                <span style="color:#e6db74">&#34;joint&#34;</span>
</span></span><span style="display:flex;"><span>                <span style="color:#e6db74">&#34;joins&#34;</span>
</span></span><span style="display:flex;"><span>                <span style="color:#e6db74">&#34;PDF&#34;</span>
</span></span><span style="display:flex;"><span>                <span style="color:#e6db74">&#34;attachment&#34;</span>))
</span></span><span style="display:flex;"><span>  <span style="color:#e6db74">&#34;A regex which - if found in the message, and if there is no
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">attachment - should launch the no-attachment warning.&#34;</span>)
</span></span><span style="display:flex;"><span>(defcustom message-attachment-reminder
</span></span><span style="display:flex;"><span>  <span style="color:#e6db74">&#34;Are you sure you want to send this message without any attachment? &#34;</span>
</span></span><span style="display:flex;"><span>  <span style="color:#e6db74">&#34;The default question asked when trying to send a message
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">containing </span><span style="color:#e6db74">`message-attachment-intent-re&#39;</span><span style="color:#e6db74"> without an
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">actual attachment.&#34;</span>)
</span></span><span style="display:flex;"><span>(defun message-warn-if-no-attachments ()
</span></span><span style="display:flex;"><span>  <span style="color:#e6db74">&#34;Ask the user if s?he wants to send the message even though
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">there are no attachments.&#34;</span>
</span></span><span style="display:flex;"><span>  (when (and (save-excursion
</span></span><span style="display:flex;"><span>               (save-restriction
</span></span><span style="display:flex;"><span>                 (<span style="color:#a6e22e">widen</span>)
</span></span><span style="display:flex;"><span>                 (<span style="color:#a6e22e">goto-char</span> (<span style="color:#a6e22e">point-min</span>))
</span></span><span style="display:flex;"><span>                 (<span style="color:#a6e22e">re-search-forward</span> message-attachment-intent-re <span style="color:#66d9ef">nil</span> <span style="color:#66d9ef">t</span>)))
</span></span><span style="display:flex;"><span>             (not (message-attachment-present-p)))
</span></span><span style="display:flex;"><span>    (unless (y-or-n-p message-attachment-reminder)
</span></span><span style="display:flex;"><span>      (keyboard-quit))))
</span></span><span style="display:flex;"><span><span style="color:#75715e">;; add hook to message-send-hook (so also works with gnus)</span>
</span></span><span style="display:flex;"><span>(add-hook <span style="color:#e6db74">&#39;message-send-hook</span> <span style="color:#a6e22e">#&#39;</span>message-warn-if-no-attachments)</span></span></code></pre></div>
</div>
</div>
</div>
