content/blog/setting-up-emacs-with-mu4e-protonmail-and-gmail/index.org
** Creating .authinfo.gpg file
This file will contain your SMTP password used by emacs to send emails.


#+begin_src shell
machine smtp.gmail.com login email@gmail.com password PASSWORDHERE port 587 
#+end_src


** Using Mu4e

Evaluate the code blocks above and launch Mu4e

#+begin_src 
M-x mu4e
#+end_src
