public/blog/setting-up-emacs-with-mu4e-protonmail-and-gmail/index.html
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
Creating .authinfo.gpg file
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>This file will contain your SMTP password used by emacs to send emails.</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>machine smtp.gmail.com login email@gmail.com password PASSWORDHERE port <span style="color:#ae81ff">587</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
Using Mu4e
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>
Evaluate the code blocks above and launch Mu4e</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>M-x mu4e</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
